app/views/users/show.html.erb

<p>
	<h3>Projects: (<%= @user.projects.count %>)</h3>
---
SELECT "projects".* FROM "projects"  WHERE "projects"."user_id" = $1  ORDER BY end_date DESC  [["user_id", 7]]
SELECT COUNT(*) FROM "projects"  WHERE "projects"."user_id" = $1  [["user_id", 7]]