app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects"   ORDER BY end_date DESC

  def new
    @project = Project.new
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]

  def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "description", "end_date", "name", "start_date", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_project
      @project = Project.find(params[:id])
      @user = User.find(@project.user_id)
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1  ORDER BY end_date DESC LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]