app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-06-18 08:37:19.169176"], ["email", "nikhilpai2016@u.northwestern.edu"], ["first_name", "Nikhil"], ["last_name", "Pai"], ["updated_at", "2014-06-18 08:37:19.169176"]]